app/Controllers/Compositores.php

INSERT INTO `compositores` (`nome`, `descricao`, `id_genero_musical`, `created_at`, `updated_at`) VALUES ('Bon Jovi', 'saokdjmasodkjmasldkasd', '2', '2022-04-03 18:18:20', '2022-04-03 18:18:20')
---
            echo view('user/templates/html-footer');
        }

        $compositores_model->save($arraySave);