app/Models/CompositoresModel.php

    public function getCompositores($id = false){
        if(!$id){
            return $this->findAll();
---
SELECT *
FROM `compositores`
WHERE `compositores`.`deleted_at` IS NULL