app/Models/CompositoresModel.php

    public function getCompositores($id = false){
        if(!$id){
            return $this->select('compositores.id, compositores.nome as `compositor_nome` ,generos_musicais.nome as `genero_musical_nome`, compositores.avatar_img')
                ->join('generos_musicais','generos_musicais.id = compositores.id_genero_musical')
                ->findAll();
---
SELECT `compositores`.`id`, `compositores`.`nome` as `compositor_nome`, `generos_musicais`.`nome` as `genero_musical_nome`, `compositores`.`avatar_img`
FROM `compositores`
JOIN `generos_musicais` ON `generos_musicais`.`id` = `compositores`.`id_genero_musical`
WHERE `compositores`.`deleted_at` IS NULL