app/Models/GenerosMusicaisModel.php

SELECT *
FROM `generos_musicais`
WHERE `generos_musicais`.`deleted_at` IS NULL
SELECT *
FROM `generos_musicais`
WHERE `generos_musicais`.`deleted_at` IS NULL
ORDER BY `id` ASC
---
    public function getGenerosMusicais($id = false){
        if(!$id){
            return $this->findAll();
        } else {
            return $this->asArray()
                ->where(['id' => $id])
                ->first();